Revit 2024 API
BuiltInFailures.EnergyAnalysisFailures.NoSpaceBoundingElementsWarn Property
 Can't create any energy analysis surfaces. There are no Space bounding elements defined in the current phase. Please check the Project Information settings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId NoSpaceBoundingElementsWarn { get; }
Visual Basic
Public Shared ReadOnly Property NoSpaceBoundingElementsWarn As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ NoSpaceBoundingElementsWarn {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.EnergyAnalysisFailures Class
Autodesk.Revit.DB Namespace